Repository: dinukrana2000/Angular_Front_end_Bloging_Web
Catalog: src/locale/messages.*.xlf
Languages: si

source: Log in
si: ඇතුල් වන්න

source: Cancel
si: අවලංගු කරන්න

source: Sign up
si: ලියාපදිංචි වන්න

source: Forgot Password
si: මුරපදය අමතකද

source: Password
si: මුරපදය

source: Confirm Password
si: මුරපදය තහවුරු කරන්න

source: Username
si: පරිශීලක නාමය

# error1
source: Username is required
si: පරිශීලක නාමය අත්‍යවශ්‍ය වේ

# error2
source: Username must be at least 3 characters
si: පරිශීලක නාමය අවම වශයෙන් අකුරු 3 ක් විය යුතුය

# error3
source: Username must be at most 20 characters
si: පරිශීලක නාමය උපරිමයෙන් අකුරු 20 ක් විය යුතුය

# error4
source: At least one number and letter needed no symbols
si: අවම වශයෙන් එක් අංකයක් සහ අකුරක් අවශ්‍ය වේ

source: Email
si: ඊමේල්

# error5
source: Email is required
si: ඊමේල් අවශ්‍ය වේ

# error6
source: Email is invalid
si: ඊමේල් වලංගු නැත

# error7
source: Email is maximum 100 characters
si: ඊමේල් උපරිමයෙන් අකුරු 100 ක් වේ

source: Address
si: ලිපිනය

# error8
source: Address is required
si: ලිපිනය අවශ්‍ය වේ

# error9
source: Address must be at least 5 characters
si: ලිපිනය අවම වශයෙන් අකුරු 5 ක් විය යුතුය

# error10
source: Address must be no more than 50 characters
si: ලිපිනය අකුරු 50 කට අඩු විය යුතුය

source: Contact
si: සම්බන්ධ

# error11
source: Contact is required
si: සම්බන්ධතාව අවශ්‍ය වේ

# error12
source: Contact must be at least 10 characters
si: සම්බන්ධතාව අවම වශයෙන් අකුරු 10 ක් විය යුතුය

# error13
source: Contact must be at most 10 characters
si: සම්බන්ධතාව උපරිමයෙන් අකුරු 10 ක් විය යුතුය

# error14
source: Contact must only be numbers
si: සම්බන්ධතාවයේ අංක පමණක් විය යුතුය

# error15
source: Password is required
si: මුරපදය අවශ්‍ය වේ

# error16
source: Password must be at least 6 characters
si: මුරපදය අවම වශයෙන් අකුරු 6 ක් විය යුතුය

# error17
source: Password must be at most 15 characters
si: මුරපදය උපරිමයෙන් අකුරු 15 ක් විය යුතුය

# error18
source: Must be at least one number, one uppercase, and one lowercase letter with no symbols
si: සංකේත නොමැති අවම වශයෙන් එක් අංකයක්, ලොකු අකුරක් සහ කුඩා අකුරක්වත් විය යුතුය

# error19
source: Confirm Password is required
si: මුරපදය තහවුරු කිරීම අවශ්‍ය වේ

# error20
source: Passwords do not match
si: මුරපද ගැලපෙන්නේ නැත
